In [2]:
import pandas as pd

In [3]:
data = {"col1": [1,2,3,4,5,6], "col2":[1,4,9,16,25,None], "col3":["mumbai", "delhi", "bangalore", "pune", "hyderabad", "chennai"]}

In [4]:
df = pd.DataFrame(data)
df

   col1  col2       col3
0     1   1.0     mumbai
1     2   4.0      delhi
2     3   9.0  bangalore
3     4  16.0       pune
4     5  25.0  hyderabad
5     6   NaN    chennai

In [6]:
def square(x):
    return x**2

In [7]:
df['col4'] = df['col1'].apply(square)
df

   col1  col2       col3  col4
0     1   1.0     mumbai     1
1     2   4.0      delhi     4
2     3   9.0  bangalore     9
3     4  16.0       pune    16
4     5  25.0  hyderabad    25
5     6   NaN    chennai    36

In [8]:
df['col5'] = df['col1'].apply(lambda x: x**3)
df

   col1  col2       col3  col4  col5
0     1   1.0     mumbai     1     1
1     2   4.0      delhi     4     8
2     3   9.0  bangalore     9    27
3     4  16.0       pune    16    64
4     5  25.0  hyderabad    25   125
5     6   NaN    chennai    36   216

In [10]:
df

   col1  col2       col3  col4  col5
0     1   1.0     mumbai     1     1
1     2   4.0      delhi     4     8
2     3   9.0  bangalore     9    27
3     4  16.0       pune    16    64
4     5  25.0  hyderabad    25   125
5     6   NaN    chennai    36   216

In [13]:
df['col1'] = df['col1'].apply(square)

In [9]:
df[['col1', 'col2']].apply(square)

   col1   col2
0     1    1.0
1     4   16.0
2     9   81.0
3    16  256.0
4    25  625.0
5    36    NaN

In [14]:
df

   col1  col2       col3  col4  col5
0     1   1.0     mumbai     1     1
1     4   4.0      delhi     4     8
2     9   9.0  bangalore     9    27
3    16  16.0       pune    16    64
4    25  25.0  hyderabad    25   125
5    36   NaN    chennai    36   216

In [17]:
df.columns.to_list()

['col1', 'col2', 'col3', 'col4', 'col5']

In [18]:
type(df.columns.to_list())

list

In [19]:
data = {"col1": [1,2,3,3,5,5],
"col2":[1,4,4,16,25,None], 
"col3":["mumbai", "delhi", "bangalore", "delhi", "hyderabad", "chennai"]}

In [20]:
df = pd.DataFrame(data)
df

   col1  col2       col3
0     1   1.0     mumbai
1     2   4.0      delhi
2     3   4.0  bangalore
3     3  16.0      delhi
4     5  25.0  hyderabad
5     5   NaN    chennai

In [21]:
df.count()

col1    6
col2    5
col3    6
dtype: int64

In [22]:
df['col1'].unique()

array([1, 2, 3, 5])

In [23]:
df['col2'].unique()

array([ 1.,  4., 16., 25., nan])

In [24]:
df['col1'].value_counts()

3    2
5    2
1    1
2    1
Name: col1, dtype: int64

In [25]:
df['col1'].value_counts(ascending=True)

1    1
2    1
3    2
5    2
Name: col1, dtype: int64

In [28]:
df[['col2','col3']].value_counts(sort=False)

col2  col3
1.0   mumbai       1
4.0   bangalore    1
      delhi        1
16.0  delhi        1
25.0  hyderabad    1
dtype: int64

In [29]:
df[['col2','col3']].value_counts(sort=True)

col2  col3
1.0   mumbai       1
4.0   bangalore    1
      delhi        1
16.0  delhi        1
25.0  hyderabad    1
dtype: int64

In [30]:
df['col4']= df['col3']
df

   col1  col2       col3       col4
0     1   1.0     mumbai     mumbai
1     2   4.0      delhi      delhi
2     3   4.0  bangalore  bangalore
3     3  16.0      delhi      delhi
4     5  25.0  hyderabad  hyderabad
5     5   NaN    chennai    chennai

In [39]:
# Sort values ascending
df.sort_values(by=['col3'], ascending=True)

   col1  col2       col3       col4
2     3   4.0  bangalore  bangalore
5     5   NaN    chennai    chennai
1     2   4.0      delhi      delhi
3     3  16.0      delhi      delhi
4     5  25.0  hyderabad  hyderabad
0     1   1.0     mumbai     mumbai

In [40]:
df.sort_values(by=['col3'], ascending=False)

   col1  col2       col3       col4
0     1   1.0     mumbai     mumbai
4     5  25.0  hyderabad  hyderabad
1     2   4.0      delhi      delhi
3     3  16.0      delhi      delhi
5     5   NaN    chennai    chennai
2     3   4.0  bangalore  bangalore

In [41]:
df[['col1']]

   col1
0     1
1     2
2     3
3     3
4     5
5     5

In [42]:
df['col1'].value_counts(ascending=True)

1    1
2    1
3    2
5    2
Name: col1, dtype: int64

In [43]:
df['col1'].value_counts(ascending=False)

3    2
5    2
1    1
2    1
Name: col1, dtype: int64

In [44]:
data1={"col1":[1,2,3,4,5,6],'col2':[4,6,7,8,9,10],'col3':[11,12,13,14,15,16]}

In [45]:
df1 = pd.DataFrame(data1)
df1

   col1  col2  col3
0     1     4    11
1     2     6    12
2     3     7    13
3     4     8    14
4     5     9    15
5     6    10    16

In [47]:
df1['col1'].value_counts(ascending=False)

1    1
2    1
3    1
4    1
5    1
6    1
Name: col1, dtype: int64

In [48]:
df1['col1'].value_counts(ascending=True)

1    1
2    1
3    1
4    1
5    1
6    1
Name: col1, dtype: int64

In [50]:
df1.sort_values(by=['col1'], ascending=True)

   col1  col2  col3
0     1     4    11
1     2     6    12
2     3     7    13
3     4     8    14
4     5     9    15
5     6    10    16

In [51]:
df1.sort_values(by=['col1'], ascending=False)

   col1  col2  col3
5     6    10    16
4     5     9    15
3     4     8    14
2     3     7    13
1     2     6    12
0     1     4    11

In [56]:
df['col1'].value_counts(normalize=False)

3    2
5    2
1    1
2    1
Name: col1, dtype: int64

In [57]:
df['col1'].value_counts(normalize=True)

3    0.333333
5    0.333333
1    0.166667
2    0.166667
Name: col1, dtype: float64

In [ ]:
df1['col1'].value_counts(normalize=False)

In [59]:
df.sort_values(by=['col3'], ascending=False)

   col1  col2       col3       col4
0     1   1.0     mumbai     mumbai
4     5  25.0  hyderabad  hyderabad
1     2   4.0      delhi      delhi
3     3  16.0      delhi      delhi
5     5   NaN    chennai    chennai
2     3   4.0  bangalore  bangalore

In [60]:
df.sort_values(by=['col3','col2'], ascending=False)

   col1  col2       col3       col4
0     1   1.0     mumbai     mumbai
4     5  25.0  hyderabad  hyderabad
3     3  16.0      delhi      delhi
1     2   4.0      delhi      delhi
5     5   NaN    chennai    chennai
2     3   4.0  bangalore  bangalore

In [61]:
df.sort_values(by=['col2'], ascending=False)

   col1  col2       col3       col4
4     5  25.0  hyderabad  hyderabad
3     3  16.0      delhi      delhi
1     2   4.0      delhi      delhi
2     3   4.0  bangalore  bangalore
0     1   1.0     mumbai     mumbai
5     5   NaN    chennai    chennai

In [63]:
df.sort_values(by=['col3'], ascending=False)

   col1  col2       col3       col4
0     1   1.0     mumbai     mumbai
4     5  25.0  hyderabad  hyderabad
1     2   4.0      delhi      delhi
3     3  16.0      delhi      delhi
5     5   NaN    chennai    chennai
2     3   4.0  bangalore  bangalore

In [62]:
df.sort_values(by=['col3','col1'], ascending=False)

   col1  col2       col3       col4
0     1   1.0     mumbai     mumbai
4     5  25.0  hyderabad  hyderabad
3     3  16.0      delhi      delhi
1     2   4.0      delhi      delhi
5     5   NaN    chennai    chennai
2     3   4.0  bangalore  bangalore